Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Add 'count' number of bits from 'data' to the unstuffer
// The bits are shifted left into stuffed_bits, and count_stuff is set to the number of bits added
void BitUnstuffer::AddBits(uint32_t data, uint32_t count) noexcept
{
    const uint32_t mask = (1u << count) - 1;
    stuffed_bits = (stuffed_bits << count) | (data & mask);
    count_stuff = count;
}

// Reset state and set the next desired 'count' unstuffed bits to extract
void BitUnstuffer::SetCount(uint32_t count) noexcept
{
    unstuffed_bits = 0;
    count_unstuff = count;
}

// Clear bitstuffing state (used after crc field to avoid bitstuffing ack field)
void BitUnstuffer::ClearState() noexcept
{
    const uint32_t lb = 1u << count_stuff;
    stuffed_bits = (stuffed_bits & (lb - 1)) | lb;
}

// Pull bits from unstuffer (as specified in unstuf_set_count())
// Return 0 if successful, 1 if need more data, -1 or -2 or -3 if there was an unstuffing error
int BitUnstuffer::PullBits() noexcept
{
    const uint32_t sb = stuffed_bits;
    if (usingFixedStuffBits)
    {
    	while (count_unstuff != 0 && count_stuff != 0)
    	{
    		if (bitsUntilFixedStuffBit == 0)
    		{
    			// Check that this is the inverse of the previous bit
    			if (((unstuffed_bits ^ (unstuffed_bits >> 1)) & (1u << (count_stuff - 1))) == 0)
    			{
    				return -3;
    			}
    			--count_stuff;
    		}
    		else
    		{
    			const uint32_t toExtract = min<uint32_t>(count_unstuff, min<uint32_t>(count_stuff, bitsUntilFixedStuffBit));
    			unstuffed_bits = (unstuffed_bits << toExtract)
    							| ((stuffed_bits >> (count_stuff - toExtract)) & ((1u << toExtract) - 1));
    			count_stuff -= toExtract;
    			count_unstuff -= toExtract;
     		}
    	}
    	return unstuffed_bits;
    }

    // Else using variable stuff bits
    const uint32_t edges = sb ^ (sb >> 1);
	const uint32_t e2 = edges | (edges >> 1);
	const uint32_t e4 = e2 | (e2 >> 2);
	const uint32_t rm_bits = ~e4;
	uint32_t cs = count_stuff;
	uint32_t cu = count_unstuff;
	if (cs == 0)
	{
		// Need more data
		return 1;
	}
	while (true)
	{
		uint32_t try_cnt = cs > cu ? cu : cs;
		for (;;)
		{
			const uint32_t try_mask = ((1 << try_cnt) - 1) << (cs + 1 - try_cnt);
			if (likely((rm_bits & try_mask) == 0))
			{
				// No stuff bits in try_cnt bits - copy into unstuffed_bits
				count_unstuff = cu = cu - try_cnt;
				count_stuff = cs = cs - try_cnt;
				unstuffed_bits |= ((sb >> cs) & ((1u << try_cnt) - 1)) << cu;
				if (cu == 0)
				{
					// Extracted desired bits
					return 0;
				}
				break;
			}
			count_stuff = cs = cs - 1;
			if (rm_bits & (1u << (cs + 1)))
			{
				// High bit of try_cnt a stuff bit
				if (unlikely(rm_bits & (1u << cs)))
				{
					// Six consecutive bits - a bitstuff error
					return ((sb >> cs) & 1u) ? -1 : -2;
				}
				break;
			}
			// High bit not a stuff bit - limit try_cnt and retry
			count_unstuff = cu = cu - 1;
			unstuffed_bits |= ((sb >> cs) & 1) << cu;
			try_cnt /= 2;
		}
		if (likely(cs == 0))
		{
			// Need more data
			return 1;
		}
	}
}

// Signal the bit stuffer to expect a stuff bit next and another after every 4 bits subsequently
void BitUnstuffer::UseFixedStuffBits() noexcept
{
	usingFixedStuffBits = true;
	bitsUntilFixedStuffBit = 0;
}

/****************************************************************
 * Bit stuffing
 ****************************************************************/

// State storage for building bit stuffed transmit messages
class BitStuffer
{
public:
	BitStuffer(uint32_t *p_buf) noexcept : prev_stuffed(1), bitpos(0), totalStuffBits(0), buf(p_buf) { }
	void pushraw(uint32_t data, uint32_t count) noexcept;
	void push(uint32_t data, uint32_t count) noexcept;
	void AddFixedStuffBit() noexcept;
	uint32_t finalize() noexcept;
	uint32_t stuff(uint32_t& pb, uint32_t num_bits) noexcept;
	uint32_t GetTotalStuffBits() const noexcept { return totalStuffBits; }
	uint32_t GetTotalBits() const noexcept { return bitpos; }

private:
    uint32_t prev_stuffed;		// the previous 5 (or more) bits we have stored in the buffer, so we can tell whether stuffing is needed when we store more bits
    uint32_t bitpos;			// how many bits we have stored in the buffer already
    uint32_t totalStuffBits;
    uint32_t *buf;				// the buffer we are stuffing into
};

// Push 'count' bits of 'data' into stuffer without performing bit stuffing
void BitStuffer::pushraw(uint32_t data, uint32_t count) noexcept
pre(count <= 32)
{
    const uint32_t wp = bitpos / 32;					// current index into the buffer
    const uint32_t bitavail = 32 - (bitpos % 32);		// number of bits available in the word at the current index, 1 to 32
    if (bitavail == 32)
    {
    	buf[wp] = data << (32 - count);
    }
    else if (bitavail >= count)
    {
    	buf[wp] |= data << (bitavail - count);
    }
    else
    {
    	buf[wp] |= data >> (count - bitavail);
    	buf[wp + 1] = data << (32 - (count - bitavail));
    }
    bitpos += count;
}

// Push 'count' (max 26) bits of 'data' into stuffer
void BitStuffer::push(uint32_t data, uint32_t count) noexcept
pre(count <= 26)										// the stuffer may expand 26 bits to 32
{
    data &= (1 << count) - 1;							// clear the high bits
    uint32_t stuf = (prev_stuffed << count) | data;
    const uint32_t newcount = stuff(stuf, count);
    pushraw(stuf, newcount);
    prev_stuffed = stuf;
}

// Pad final word of stuffer with high bits
uint32_t BitStuffer::finalize() noexcept
{
    const uint32_t words = DIV_ROUND_UP(bitpos, 32);
    const uint32_t extra = words * 32 - bitpos;
    if (extra)
    {
        buf[words - 1] |= (1 << extra) - 1;
    }
    return words;
}

// Add a fixed stuff bit, not included in the count of total stuff bits
void BitStuffer::AddFixedStuffBit() noexcept
{
	prev_stuffed = (prev_stuffed << 1) | ((prev_stuffed & 1u) ^ 1u);
	pushraw(prev_stuffed & 1u, 1);
}

// Stuff 'num_bits' (max 26) bits in 'pb' - upper bits must already be stuffed. Return the count of bits generated.
uint32_t BitStuffer::stuff(uint32_t& pb, uint32_t num_bits) noexcept
pre(count <= 26)
{
    uint32_t b = pb;
    uint32_t count = num_bits;
    for (;;)
    {
        uint32_t try_cnt = num_bits;
        const uint32_t edges = b ^ (b >> 1);
        const uint32_t e2 = edges | (edges >> 1), e4 = e2 | (e2 >> 2);
        const uint32_t add_bits = ~e4;
        for (;;)
        {
            const uint32_t try_mask = ((1 << try_cnt) - 1) << (num_bits - try_cnt);
            if (!(add_bits & try_mask))
            {
                // No stuff bits needed in try_cnt bits
                if (try_cnt >= num_bits) { goto done; }
                num_bits -= try_cnt;
                try_cnt = (num_bits + 1) / 2;
            }
            else
            {
				if (add_bits & (1 << (num_bits - 1)))
				{
					// A stuff bit must be inserted prior to the high bit
					const uint32_t low_mask = (1 << num_bits) - 1, low = b & low_mask;
					const uint32_t high = (b & ~(low_mask >> 1)) << 1;
					b = high ^ low ^ (1 << (num_bits - 1));
					++count;
					++totalStuffBits;
					if (num_bits <= 4) { goto done; }
					num_bits -= 4;
					break;
				}
				// High bit doesn't need stuff bit - accept it, limit try_cnt, retry
				num_bits--;
				try_cnt /= 2;
            }
        }
    }
done:
    pb = b;
    return count;
}

// CanFD2040 members
// Start CAN-FD running
void CanFD2040::Entry(VirtualCanRegisters *p_regs) noexcept
{
	regs = p_regs;
    for (;;)
    {
    	while (!regs->canEnabled) { }

    	pendingIrqs = 0;
    	pio_setup();										// Set up the PIO and pins
        data_state_go_discard();

    	while (regs->canEnabled) { }

