Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Cancel any pending checks on PIO "match" state machine
void CanFD2040::pio_match_clear() noexcept
{
    pio_match_check(0);
}

// Flush and halt PIO "tx" state machine
void CanFD2040::pio_tx_reset() noexcept
{
    pio_hw->ctrl = ((0x07 << PIO_CTRL_SM_ENABLE_LSB)
                    | (0x08 << PIO_CTRL_SM_RESTART_LSB));
    pio_hw->irq = (1 << 2) | (1<< 3); // clear "matched" and "ack done" signals
    // Clear tx fifo
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->shiftctrl = 0;
    sm->shiftctrl = (PIO_SM0_SHIFTCTRL_FJOIN_TX_BITS
                     | PIO_SM0_SHIFTCTRL_AUTOPULL_BITS);
    // Must reset again after clearing fifo
    pio_hw->ctrl = ((0x07 << PIO_CTRL_SM_ENABLE_LSB)
                    | (0x08 << PIO_CTRL_SM_RESTART_LSB));
}

// Queue a message for transmission on PIO "tx" state machine
void CanFD2040::pio_tx_send(uint32_t *data, uint32_t count) noexcept
{
    pio_tx_reset();
    pio_hw->instr_mem[can2040_offset_tx_got_recessive] = 0xa242; // nop [2]
    for (unsigned int i = 0; i < count; i++)
    {
    	pio_hw->txf[3] = data[i];
    }
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->instr = 0xe001; // set pins, 1
    sm->instr = can2040_offset_tx_start; // jmp tx_start
    sm->instr = 0x20c0; // wait 1 irq, 0
    pio_hw->ctrl = 0x0f << PIO_CTRL_SM_ENABLE_LSB;
}

// Set PIO "tx" state machine to inject an ack after a CRC match
void CanFD2040::pio_tx_inject_ack(uint32_t match_key) noexcept
{
    pio_tx_reset();
    pio_hw->instr_mem[can2040_offset_tx_got_recessive] = 0xc023; // irq wait 3
    pio_hw->txf[3] = 0x7fffffff;
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->instr = 0xe001; // set pins, 1
    sm->instr = can2040_offset_tx_start; // jmp tx_start
    sm->instr = 0x20c2; // wait 1 irq, 2
    pio_hw->ctrl = 0x0f << PIO_CTRL_SM_ENABLE_LSB;

    pio_match_check(match_key);
}

// Check if the PIO "tx" state machine stopped due to passive/dominant conflict
int CanFD2040::pio_tx_did_conflict() noexcept
{
    return pio_hw->sm[3].addr == can2040_offset_tx_conflict;
}

// Enable host irq on a "may transmit" signal (sm irq 0)
void CanFD2040::pio_irq_set_maytx() noexcept
{
    pio_hw->inte0 = PIO_IRQ0_INTE_SM0_BITS | PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS;
}

// Enable host irq on a "may transmit" or "matched" signal (sm irq 0 or 2)
void CanFD2040::pio_irq_set_maytx_matched() noexcept
{
    pio_hw->inte0 = (PIO_IRQ0_INTE_SM0_BITS | PIO_IRQ0_INTE_SM2_BITS
                     | PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS);
}

// Enable host irq on a "may transmit" or "ack done" signal (sm irq 0 or 3)
void CanFD2040::pio_irq_set_maytx_ackdone() noexcept
{
    pio_hw->inte0 = (PIO_IRQ0_INTE_SM0_BITS | PIO_IRQ0_INTE_SM3_BITS
                     | PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS);
}

// Atomically enable "may transmit" signal (sm irq 0)
void CanFD2040::pio_irq_atomic_set_maytx() noexcept
{
    hw_set_bits(&pio_hw->inte0, PIO_IRQ0_INTE_SM0_BITS);
}

// Disable PIO host irqs (except for normal data read irq)
void CanFD2040::pio_irq_set_none() noexcept
{
    pio_hw->inte0 = PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS;
}

// Setup PIO state machines
void CanFD2040::pio_sm_setup() noexcept
{
    // Reset state machines
    pio_hw->ctrl = PIO_CTRL_SM_RESTART_BITS | PIO_CTRL_CLKDIV_RESTART_BITS;
    pio_hw->fdebug = 0xffffffff;

    // Load pio program
    for (unsigned int i=0; i<ARRAY_SIZE(can2040_program_instructions); i++)
    {
    	pio_hw->instr_mem[i] = can2040_program_instructions[i];
    }

    // Set initial state machine state
    pio_sync_setup();
    pio_rx_setup();
    pio_match_setup();
    pio_tx_setup();

    // Start state machines
    pio_hw->ctrl = 0x07 << PIO_CTRL_SM_ENABLE_LSB;
}

// Report error to calling code (via callback interface)
void CanFD2040::report_callback_error(uint32_t error_code) noexcept
{
    //TODO
}

// Report a received message to calling code (via callback interface)
void CanFD2040::report_callback_rx_msg() noexcept
{
	switch (rxFifoNumber)
	{
	case 0:
		{
			unsigned int putPointer = regs->rxFifo0PutIndex;
			CanRxBuffer& rxBuffer = const_cast<CanRxBuffer&>(regs->rxFifo0Addr[putPointer]);
			rxBuffer.R0.bit.ID = parse_id;
			rxBuffer.R1.bit.DLC = parse_dlc;
			++putPointer;
			if (putPointer == regs->rxFifo0Size)
			{
				putPointer = 0;
			}
			regs->rxFifo0PutIndex = putPointer;
			pendingIrqs |= VirtualCanRegisters::recdFifo0;
		}
		break;

	case 1:
		{
			unsigned int putPointer = regs->rxFifo1PutIndex;
			CanRxBuffer& rxBuffer = const_cast<CanRxBuffer&>(regs->rxFifo1Addr[putPointer]);
			rxBuffer.R0.bit.ID = parse_id;
			rxBuffer.R1.bit.DLC = parse_dlc;
			++putPointer;
			if (putPointer == regs->rxFifo1Size)
			{
				putPointer = 0;
			}
			regs->rxFifo1PutIndex = putPointer;
			pendingIrqs |= VirtualCanRegisters::recdFifo1;
		}
		break;

	default:
		break;
	}

	SendInterrupts();
	debugPrintf("id=%08" PRIx32 " fifo=%u\n", parse_id, rxFifoNumber);
}

// Report a message that was successfully transmitted (via callback interface)
void CanFD2040::report_callback_tx_msg() noexcept
{
	// We don't support the Tx event fifo yet
}

// EOF phase complete - report message (rx or tx) to calling code
void CanFD2040::report_handle_eof() noexcept
{
    if (report_state == ReportState::RS_IDLE)
    {
        // Message already reported or an unexpected EOF
        return;
    }
    if (report_state & ReportState::RS_AWAIT_EOF)
    {
        // Successfully processed a new message - report to calling code
        pio_sync_normal_start_signal();
        if (report_state & ReportState::RS_IS_TX)
        {
            report_callback_tx_msg();
        }
        else
        {
            report_callback_rx_msg();
        }
    }
    report_state = ReportState::RS_IDLE;
    pio_match_clear();
}

// Check if in an rx ack is pending
int CanFD2040::report_is_acking_rx() noexcept
{
    return report_state == (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_AWAIT_EOF);
}

// Parser found a new message start
void CanFD2040::report_note_message_start() noexcept
{
    pio_irq_set_maytx();
}

// Setup for ack injection (if receiving) or ack confirmation (if transmit)
void CanFD2040::report_note_crc_start() noexcept
{
	// Get 19 bits of expected data (lower 15 bits of CRC plus 4 stuff bits)
	uint32_t expectedData = (parse_crc & 0x01)						// bit 0 of CRC
						  | (~parse_crc & 0x02)						// fixed stuff bit = inverse of bit 1
						  | ((parse_crc & 0x1e) << 1)				// bits 1-4 of CRC
						  | ((~parse_crc & 0x20) << 1)				// fixed stuff bit = inverse of bit 5
						  | ((parse_crc & 0x1e0) << 2)				// bits 5-8 of CRC
						  | ((~parse_crc & 0x0200) << 2)			// fixed stuff bit = inverse of bit 9
						  | ((parse_crc & 0x1e00) << 3)				// bits 9-12 of CRC
						  | ((~parse_crc & 0x2000) << 3)			// fixed stuff bit = inverse of bit 13
						  | ((parse_crc & 0x6000) << 4);			// bits 13-14 of CRC
    const uint32_t cs = unstuf.GetStuffCount();
    const uint32_t crcstart_bitpos = raw_bit_count - cs - 1;
    const uint32_t crcend_bitpos = crcstart_bitpos + 19;

    if (tx_check_local_message())
    {
        // This is a self transmit - setup tx eof "matched" signal
        report_state = (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_IS_TX);
        expectedData = (expectedData << 10) | 0x02ff;
        pio_match_check(pio_match_calc_key(expectedData, crcend_bitpos + 10));
    }
    else if (rxFifoNumber >= 0)
    {
		// Inject ack
		report_state = ReportState::RS_IN_MSG;
		expectedData = (expectedData << 1) | 0x01;
		const uint32_t match_key = pio_match_calc_key(expectedData, crcend_bitpos + 1);
	    if (   tx_state == TS_QUEUED
	    	&& !pio_tx_did_conflict()
	        && pio_rx_fifo_level() > 1
		   )
	    {
	        // Rx state is behind - acking wont succeed and may halt active tx
	    }
	    else
	    {
			tx_state = TS_ACKING_RX;
			pio_tx_inject_ack(match_key);
			pio_irq_set_maytx_ackdone();

