Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
			// Setup for future rx eof "matched" signal
			expectedData = (expectedData << 8) | 0x7f;
			report_eof_key = pio_match_calc_key(expectedData, crcend_bitpos + 9);
		}
    }
}

// Parser found successful ack
void CanFD2040::report_note_ack_success() noexcept
{
    if (!(report_state & ReportState::RS_IN_MSG))
        // Got rx "ackdone" and "matched" signals already
        return;
    report_state = (ReportState)(report_state | ReportState::RS_AWAIT_EOF);
    if (report_state & ReportState::RS_IS_TX)
        // Enable "matched" irq for fast back-to-back transmit scheduling
        pio_irq_set_maytx_matched();
}

// Parser found successful EOF
void CanFD2040::report_note_eof_success() noexcept
{
    report_handle_eof();
}

// Parser found unexpected data on input
void CanFD2040::report_note_parse_error() noexcept
{
    if (report_state != ReportState::RS_IDLE) {
        report_state = ReportState::RS_IDLE;
        pio_match_clear();
    }
    pio_sync_slow_start_signal();
    pio_irq_set_maytx();
}

// Received PIO rx "ackdone" irq
void CanFD2040::report_line_ackdone() noexcept
{
    if (!(report_state & ReportState::RS_IN_MSG)) {
        // Parser already processed ack and eof bits
        pio_irq_set_maytx();
        return;
    }
    // Setup "matched" irq for fast rx callbacks
    report_state = (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_AWAIT_EOF);
    pio_match_check(report_eof_key);
    pio_irq_set_maytx_matched();
    // Schedule next transmit (so it is ready for next frame line arbitration)
    tx_schedule_transmit();
}

// Received PIO "matched" irq
void CanFD2040::report_line_matched() noexcept
{
    // Implement fast rx callback and/or fast back-to-back tx scheduling
    report_handle_eof();
    pio_irq_set_none();
    tx_schedule_transmit();
}

// Received 10+ passive bits on the line (between 10 and 17 bits)
void CanFD2040::report_line_maytx() noexcept
{
    // Line is idle - may be unexpected EOF, missed ack injection,
    // missed "matched" signal, or can2040_transmit() kick.
    report_handle_eof();
    pio_irq_set_none();
    tx_schedule_transmit();
}

// Transition to the next parsing state
void CanFD2040::data_state_go_next(ParseState state, uint32_t bits) noexcept
{
    parse_state = state;
    unstuf.SetCount(bits);
}

// Transition to the MS_DISCARD state - drop all bits until 6 passive bits
void CanFD2040::data_state_go_discard() noexcept
{
    report_note_parse_error();

    if (pio_rx_check_stall())
    {
        // CPU couldn't keep up for some read data - must reset pio state
        raw_bit_count = 0;
        unstuf.ClearStuffCount();
        pio_sm_setup();
        report_callback_error(0);
    }

    data_state_go_next(MS_DISCARD, 32);
}

// Received six dominant bits on the line
void CanFD2040::data_state_line_error() noexcept
{
    data_state_go_discard();
}

// Received six passive bits on the line
void CanFD2040::data_state_line_passive() noexcept
{
    if (parse_state != MS_DISCARD)
    {
        // Bitstuff error
        data_state_go_discard();
    }
    else
    {
		const uint32_t stuffed_bits = unstuf.GetStuffedBits() >> unstuf.GetStuffCount();
		if (stuffed_bits == 0xffffffff)
		{
			// Counter overflow in "sync" state machine - reset it
			pio_sync_setup();
			unstuf.ClearStuffedBits();
			data_state_go_discard();
		}
		else if (((stuffed_bits + 1) & 0x1ff) == 0)		// look for sof after 9 passive bits (most "PIO sync" will produce)
		{
			data_state_go_next(MS_START, 1);
		}
		else
		{
			data_state_go_discard();
		}
    }
}

// Transition to MS_DATA0 state (if applicable) - await data bits
void CanFD2040::data_state_go_data() noexcept
{
	if (parse_dlc == 0)
    {
        data_state_go_stuff_count();						// no data in packet
    }
	else
	{
		parse_bytesReceived = 0;
		parse_bytesLeft = (parse_dlc <= 8) ? parse_dlc
							: (parse_dlc <= 12) ? (parse_dlc - 6) << 2
								: (parse_dlc - 11) << 4;
		data_state_go_next(MS_DATA, 8 * min<uint32_t>(parse_bytesLeft, 4));
	}
}

// Transition to MS_STUFFCOUNT state
void CanFD2040::data_state_go_stuff_count() noexcept
{
	unstuf.UseFixedStuffBits();								// tell the unstuffer that the next bit and then every 4 bits are forced stuff bits
	data_state_go_next(MS_STUFFCOUNT, (parse_dlc >= 10) ? 10 : 6);	// receive the 4 stuff count bits + the first 2 or 6 CRC bits (and 2 fixed stuff bits)
}

// Handle reception of first bit of header (after start-of-frame (SOF))
void CanFD2040::data_state_update_start(uint32_t data) noexcept
{
	rxTimeStamp = timer_hw->timerawl;						// save time stamp for later
    parse_id = data;										// store the first data bit (MSbit of ID)
    report_note_message_start();
    data_state_go_next(MS_HEADER, 17);
}

// Handle reception of next 20 header bits which for CAN-FD frame with short ID takes us up to and including the DLC bits
void CanFD2040::data_state_update_header(uint32_t data) noexcept
{
    data |= parse_id << 20;									// or in the most significant ID bit
    if ((data & 0x0300) == 0x0300)							// if SRR and ID are both set
    {
        // Extended ID
        parse_id = (data & 0x1ffc00) << 8;					// this is now the top 11 bits of the ID field
        data_state_go_next(MS_EXT_HEADER, 19);
    }
    else if ((data & 0x3e0) == 0x80)						// if r1 and IDE are both clear, FDF is set, r0 and and BRS are clear
    {
		// Short ID
		parse_id = (data >> 10) & 0x7ff;					// save the complete ID
		parse_dlc = data & 0x0F;

		// See if we are interested in this message
		rxFifoNumber = -1;
		for (unsigned int filterNumber = 0; filterNumber < regs->numShortFilterElements; ++filterNumber)
		{
			const CanStandardMessageFilterElement& f = const_cast<const CanStandardMessageFilterElement&>(regs->shortFiltersAddr[filterNumber]);
			if (f.Matches(parse_id))
			{
				rxFifoNumber = f.whichBuffer;
				break;
			}
			switch (rxFifoNumber)
			{
			case 0:
				rxMessage = const_cast<uint32_t*>(regs->rxFifo0Addr[regs->rxFifo0PutIndex].data);
				break;

			case 1:
				rxMessage = const_cast<uint32_t*>(regs->rxFifo1Addr[regs->rxFifo1PutIndex].data);
				break;

			default:
				rxMessage = rxDummyMessage;
				break;
			}
		}

		data_state_go_data();
    }
	else
	{
		data_state_go_discard();							// not a message format we can parse
	}
}

// Handle reception of additional 19 bits of "extended header" which takes us to the end of the DLC field
void CanFD2040::data_state_update_ext_header(uint32_t data) noexcept
{
	if ((data & 0x1e0) == 0x80)								// if FDF bit is set, and r1, BRS and r0 are not set
	{
		parse_id |= (data >> 9) & 0x03ffff;					// or-in the bottom 18 bits of the ID
		parse_dlc = data & 0x0F;
		// See if we are interested in this message

		rxFifoNumber = -1;
		for (unsigned int filterNumber = 0; filterNumber < regs->numShortFilterElements; ++filterNumber)
		{
			const CanExtendedMessageFilterElement& f = const_cast<const CanExtendedMessageFilterElement&>(regs->extendedFiltersAddr[filterNumber]);
			if (f.Matches(parse_id))
			{
				rxFifoNumber = f.whichBuffer;
				break;
			}
			switch (rxFifoNumber)
			{
			case 0:
				rxMessage = const_cast<uint32_t*>(regs->rxFifo0Addr[regs->rxFifo0PutIndex].data);
				break;

			case 1:
				rxMessage = const_cast<uint32_t*>(regs->rxFifo1Addr[regs->rxFifo1PutIndex].data);
				break;

			default:
				rxMessage = rxDummyMessage;
				break;
			}
		}

		data_state_go_data();
	}
	else
	{
		data_state_go_discard();
	}
}

// Handle reception of data content
void CanFD2040::data_state_update_data(uint32_t data) noexcept
{
	if (parse_bytesLeft < 4)
	{
	    rxMessage[parse_bytesReceived/4] = __builtin_bswap32(data << (32 - (8 * parse_bytesLeft)));
	    data_state_go_stuff_count();
	}
	else
	{
		rxMessage[parse_bytesReceived/4] = __builtin_bswap32(data);
		parse_bytesReceived += 4;
		parse_bytesLeft -= 4;
		if (parse_bytesLeft != 0)
		{
			data_state_go_next(MS_DATA, 8 * min<uint32_t>(parse_bytesLeft, 4));
		}
		else
		{
			data_state_go_stuff_count();
		}
	}
}

// Handle reception of 4 bits of message stuff count
void CanFD2040::data_state_update_stuffCount(uint32_t data) noexcept
{
	uint32_t stuffCount;
	uint32_t crcBits;
	if (parse_dlc >= 10)
	{
		parse_crc = unstuf.GetCrc21();		// set up the expected CRC
		stuffCount = data >> 6;				// get stuff count and parity bit
		crcBits = data & 0x3f;				// get top 6 bits of CRC
	}
	else
	{
		parse_crc = unstuf.GetCrc17();		// set up the expected CRC
		stuffCount = data >> 2;				// get stuff count and parity bit
		crcBits = data & 0x03;				// get top 2 bits of CRC
	}

	// Check stuff count parity and stuff count
	uint32_t parity = stuffCount ^ (stuffCount >> 2);
	parity ^= (parity >> 1);
#if 0	//TODO
	if (   (parity & 1)							//TODO should parity be even or odd?
		|| InverseGrayTable(stuffCount >> 1) != unstuff.GetTotalStuffBits()
	   )
	{
		data_state_go_discard();
	}
	else
#else
	(void)parity;
#endif
	if ((parse_crc >> 15) == crcBits)
	{
		// Transition to MS_CRC state - await another 15 bits of crc + delimiter
		report_note_crc_start();
		data_state_go_next(MS_CRC, 16);						// read 15 CRC bits (plus fixed stuffing bits) plus delimiter
	}
	else
	{
		data_state_go_discard();
	}
}

// Handle reception of 16 bits of message CRC (15 crc bits + crc delimiter)
void CanFD2040::data_state_update_crc(uint32_t data) noexcept
{
#if 0	//TODO don't check CRC
    if ((((parse_crc & 0x7fff) << 1) | 1) != data)
    {
        data_state_go_discard();
    }
    else
#endif
    {
		unstuf.ClearState();
		data_state_go_next(MS_ACK, 2);
    }
}

// Handle reception of 2 bits of ack phase (ack, ack delimiter)
void CanFD2040::data_state_update_ack(uint32_t data) noexcept
{
    if (data != 0x01)
    {
        data_state_go_discard();
        return;
    }
    report_note_ack_success();
    data_state_go_next(MS_EOF0, 4);
}

// Handle reception of first four end-of-frame (EOF) bits
void CanFD2040::data_state_update_eof0(uint32_t data) noexcept
{
    if (data != 0x0f || pio_rx_check_stall())
    {
        data_state_go_discard();
        return;
    }
    unstuf.ClearState();
    data_state_go_next(MS_EOF1, 4);
}

// Handle reception of end-of-frame (EOF) bits 5-7 and first IFS bit
void CanFD2040::data_state_update_eof1(uint32_t data) noexcept
{
    if (data >= 0x0e || (data >= 0x0c && report_is_acking_rx()))
    {
        // Message is considered fully transmitted
        report_note_eof_success();
    }

    if (data == 0x0f)
    {
        data_state_go_next(MS_START, 1);
    }
    else
    {
        data_state_go_discard();
    }
}

// Handle data received while in MS_DISCARD state
void CanFD2040::data_state_update_discard(uint32_t data) noexcept
{
    data_state_go_discard();
}

// Update parsing state after reading the bits of the current field
void CanFD2040::data_state_update(uint32_t data) noexcept
{
	switch (parse_state)
	{
	case MS_START:		data_state_update_start(data); break;
	case MS_HEADER:		data_state_update_header(data); break;
	case MS_EXT_HEADER:	data_state_update_ext_header(data); break;
	case MS_DATA:		data_state_update_data(data); break;
	case MS_STUFFCOUNT:	data_state_update_stuffCount(data); break;
	case MS_CRC:		data_state_update_crc(data); break;
	case MS_ACK:		data_state_update_ack(data); break;
	case MS_EOF0:		data_state_update_eof0(data); break;
	case MS_EOF1:		data_state_update_eof1(data); break;
	case MS_DISCARD:	data_state_update_discard(data); break;
	}
}

/****************************************************************
 * Input processing
 ****************************************************************/

// Process an incoming byte of data from PIO "rx" state machine
void CanFD2040::process_rx(uint32_t rx_byte) noexcept
{
	unstuf.AddBits(rx_byte, 8);
    raw_bit_count += 8;

    // undo bit stuffing
    for (;;)
    {
        int ret = unstuf.PullBits();
        if (likely(ret > 0))
        {
            // Need more data
            break;
        } else if (likely(!ret))
        {
            // Pulled the next field - process it
            data_state_update(unstuf.GetUnstuffedBits());
        } else
        {
            if (ret == -1)
            {
                // 6 consecutive high bits
                data_state_line_passive();
            }
            else
            {
                // 6 consecutive low bits
                data_state_line_error();
            }
        }
    }
}

