Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Main API irq notification function
void CanFD2040::pio_irq_handler() noexcept
{
    uint32_t ints = pio_hw->ints0;
    while (likely(ints & PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS))
    {
        uint8_t rx_byte = pio_hw->rxf[1];
        process_rx(rx_byte);
        ints = pio_hw->ints0;
        if (likely(!ints))
        {
            return;
        }
    }

    if (ints & PIO_IRQ0_INTE_SM3_BITS)
    {
        // Ack of received message completed successfully
        report_line_ackdone();
    }
    else if (ints & PIO_IRQ0_INTE_SM2_BITS)
    {
        // Transmit message completed successfully
        report_line_matched();
    }
    else if (ints & PIO_IRQ0_INTE_SM0_BITS)
    {
        // Bus is idle, but not all bits may have been flushed yet
        report_line_maytx();
    }
}

/****************************************************************
 * Transmit state tracking
 ****************************************************************/

// Queue the next message for transmission in the PIO
void CanFD2040::tx_schedule_transmit() noexcept
{
    if (tx_state == TS_QUEUED && !pio_tx_did_conflict())
    {
        // Already queued or actively transmitting
        return;
    }
    if (txStuffedWords == 0)
    {
        // No new messages to transmit
        tx_state = TS_IDLE;
        return;
    }
    tx_state = TS_QUEUED;
    pio_tx_send(txMessage, txStuffedWords);
}

// Check if the current parsed message is feedback from current transmit
bool CanFD2040::tx_check_local_message() noexcept
{
    if (tx_state == TS_QUEUED && txStuffedWords != 0 && txCrc == parse_crc && txId == parse_id && txDlc == parse_dlc)		// ideally we would check the data here too
    {
        // Received our own transmission
        tx_state = TS_CONFIRM_TX;
        return true;
    }
    return false;
}

extern VirtualCanRegisters virtualRegs;
static CanFD2040 canFdDevice;

extern "C" [[noreturn]]void Core1Entry() noexcept
{
	canFdDevice.Entry(&virtualRegs);
}

extern "C" void PIO_isr() noexcept
{
	canFdDevice.pio_irq_handler();
}

// End
